# Data Wrangling with pandas

#### Why we need pandas?
_1. Easy to import datasets
2. Data Cleansing (missing & invalid values)
3. Size mutability
4. Reshape and pivoting our datasets
5. Efficient manipulation
6. Statistical Analysis_

In [1]:
from cmath import nan

import pandas as pd
import numpy as np

#### #Series Data Structure

In [2]:
s = pd.Series([1,2,3,4,5,6])

In [3]:
s.dtype

dtype('int64')

In [4]:
s.index

RangeIndex(start=0, stop=6, step=1)

In [5]:
s.values

array([1, 2, 3, 4, 5, 6])

In [6]:
s.name = "boyos"

In [7]:
s.name

'boyos'

In [8]:
s

0    1
1    2
2    3
3    4
4    5
5    6
Name: boyos, dtype: int64

In [9]:
#Indexing
s[0]

np.int64(1)

In [10]:
s[0:2] #start(included):stop(excluded):steps(jumps value)

0    1
1    2
Name: boyos, dtype: int64

In [11]:
# iloc -> location based indexing

s.iloc[3]

np.int64(4)

In [12]:
s.iloc[[1,3,4]]

1    2
3    4
4    5
Name: boyos, dtype: int64

In [13]:
#Changing index

In [14]:
index = ["aam", "jaam", "kathal", "lichu", "apel", "kola"]

In [15]:
s.index = index

In [16]:
print(s)

aam       1
jaam      2
kathal    3
lichu     4
apel      5
kola      6
Name: boyos, dtype: int64

In [17]:
s['lichu']

np.int64(4)

In [18]:
s.iloc[4] #numerical index is absolutely fine

np.int64(5)

In [19]:
# loc ->label based indexing

s.loc['lichu']

np.int64(4)

In [20]:
#In label based indexing your start and stop value both are included

s.loc['aam':'lichu']

aam       1
jaam      2
kathal    3
lichu     4
Name: boyos, dtype: int64

In [21]:
#Accessing multiple values

In [22]:
s.loc[['kathal','lichu']]

kathal    3
lichu     4
Name: boyos, dtype: int64

In [23]:
hatir_boyos ={
    "montu" : 12,
    "jhontu": 30,
    "chotu" : 4,
    "boro" : 25,
    "dukhi" : 20,
    "sukhi" : 7,
    "chinta" : 80,
    "utsuk" : 9
}

In [24]:
siri = pd.Series(hatir_boyos, name="hatir_name")

In [25]:
print(siri)

montu     12
jhontu    30
chotu      4
boro      25
dukhi     20
sukhi      7
chinta    80
utsuk      9
Name: hatir_name, dtype: int64

##### Conditional Selection

In [26]:
siri > 20

montu     False
jhontu     True
chotu     False
boro       True
dukhi     False
sukhi     False
chinta     True
utsuk     False
Name: hatir_name, dtype: bool

In [27]:
siri[siri>20]

jhontu    30
boro      25
chinta    80
Name: hatir_name, dtype: int64

##### Logical Operators

In [28]:
[(siri>10) & (siri<30)]

[montu      True
 jhontu    False
 chotu     False
 boro       True
 dukhi      True
 sukhi     False
 chinta    False
 utsuk     False
 Name: hatir_name, dtype: bool]

In [29]:
siri[(siri>10) & (siri<30)]

montu    12
boro     25
dukhi    20
Name: hatir_name, dtype: int64

In [30]:
siri[(siri<10) | (siri>30)]

chotu      4
sukhi      7
chinta    80
utsuk      9
Name: hatir_name, dtype: int64

In [31]:
#Modifying
siri["chinta"] = 82

In [32]:
print(siri)

montu     12
jhontu    30
chotu      4
boro      25
dukhi     20
sukhi      7
chinta    82
utsuk      9
Name: hatir_name, dtype: int64

In [33]:
#Question
ser = pd.Series(['a',np.nan,1,np.nan,2])
s.notnull().sum()

np.int64(6)

#### #Data Frames

In [83]:
data = {
    "Name" : ["Montu", "Jhontu", "Chotu", "Boro", "Dukhi", "Sukhi", "Chinta", "Utsuk", "Montu"],
    "Age" : [12,30,np.nan,25,20,7,80,9,12],
    "Team" : ["Grey", "Shadow", "Red", "Red", "Grey", np.nan, "Black", "Green","Grey"],
    "Point" : [1300, 2000, np.nan, 3500, 8800, 45000, np.nan,2300,1300]
}

In [84]:
print(data)

{'Name': ['Montu', 'Jhontu', 'Chotu', 'Boro', 'Dukhi', 'Sukhi', 'Chinta', 'Utsuk', 'Montu'], 'Age': [12, 30, nan, 25, 20, 7, 80, 9, 12], 'Team': ['Grey', 'Shadow', 'Red', 'Red', 'Grey', nan, 'Black', 'Green', 'Grey'], 'Point': [1300, 2000, nan, 3500, 8800, 45000, nan, 2300, 1300]}

In [85]:
df = pd.DataFrame(data)
print(df)

     Name   Age    Team    Point
0   Montu  12.0    Grey   1300.0
1  Jhontu  30.0  Shadow   2000.0
2   Chotu   NaN     Red      NaN
3    Boro  25.0     Red   3500.0
4   Dukhi  20.0    Grey   8800.0
5   Sukhi   7.0     NaN  45000.0
6  Chinta  80.0   Black      NaN
7   Utsuk   9.0   Green   2300.0
8   Montu  12.0    Grey   1300.0

In [86]:
df.head(2)

     Name   Age    Team   Point
0   Montu  12.0    Grey  1300.0
1  Jhontu  30.0  Shadow  2000.0

In [87]:
df.tail(3) #by default->5

     Name   Age   Team   Point
6  Chinta  80.0  Black     NaN
7   Utsuk   9.0  Green  2300.0
8   Montu  12.0   Grey  1300.0

In [88]:
#loc & iloc

df.iloc[1:3]

     Name   Age    Team   Point
1  Jhontu  30.0  Shadow  2000.0
2   Chotu   NaN     Red     NaN

In [131]:
df.loc[1:3,["Age","Team"]]

    Age    Team
1  30.0  Shadow
2   NaN     Red
3  25.0     Red

In [127]:
df.iloc[1:3 , :2] #rows & columns

     Name   Age
1  Chinta  30.0
2   Chotu   NaN

In [ ]:
df["Team"]

In [ ]:
df[["Name","Team"]]

In [ ]:
#row = 0, column=1 for axis

df.drop("Boyos", axis=1)

In [ ]:
df

In [128]:
#df.drop("Boyos", axis=1, inplace=True) #by default inplace is false

In [129]:
df.shape #rows and column size

(9, 5)

In [130]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           9 non-null      str
 1   Age            8 non-null      float64
 2   Team           8 non-null      str
 3   Point          7 non-null      float64
 4   Wining Points  7 non-null      float64
dtypes: float64(3), str(2)
memory usage: 492.0 bytes

In [ ]:
df.describe()

In [ ]:
#Brodcasting
df["Points"] = df["Points"] + 250

In [ ]:
df["Points"]

In [ ]:
#Renaming columns

df.rename(columns={"Points":"Point", "Boyos":"Age"}, inplace=True)

In [ ]:
print(df)

In [ ]:
df["Team"].unique()

In [90]:
df["Team"].value_counts()

Team
Grey      3
Red       2
Shadow    1
Black     1
Green     1
Name: count, dtype: int64

In [91]:
df["Wining Points"] = df["Point"] *2

In [92]:
print(df)

     Name   Age    Team    Point  Wining Points
0   Montu  12.0    Grey   1300.0         2600.0
1  Jhontu  30.0  Shadow   2000.0         4000.0
2   Chotu   NaN     Red      NaN            NaN
3    Boro  25.0     Red   3500.0         7000.0
4   Dukhi  20.0    Grey   8800.0        17600.0
5   Sukhi   7.0     NaN  45000.0        90000.0
6  Chinta  80.0   Black      NaN            NaN
7   Utsuk   9.0   Green   2300.0         4600.0
8   Montu  12.0    Grey   1300.0         2600.0

#### Data Cleansing

In [93]:
df.isnull().sum()

Name             0
Age              1
Team             1
Point            2
Wining Points    2
dtype: int64

In [94]:
df.dropna() #by default -> how="any"

     Name   Age    Team   Point  Wining Points
0   Montu  12.0    Grey  1300.0         2600.0
1  Jhontu  30.0  Shadow  2000.0         4000.0
3    Boro  25.0     Red  3500.0         7000.0
4   Dukhi  20.0    Grey  8800.0        17600.0
7   Utsuk   9.0   Green  2300.0         4600.0
8   Montu  12.0    Grey  1300.0         2600.0

In [95]:
df.dropna(how="all") #Drop a row if all the value is NULL

     Name   Age    Team    Point  Wining Points
0   Montu  12.0    Grey   1300.0         2600.0
1  Jhontu  30.0  Shadow   2000.0         4000.0
2   Chotu   NaN     Red      NaN            NaN
3    Boro  25.0     Red   3500.0         7000.0
4   Dukhi  20.0    Grey   8800.0        17600.0
5   Sukhi   7.0     NaN  45000.0        90000.0
6  Chinta  80.0   Black      NaN            NaN
7   Utsuk   9.0   Green   2300.0         4600.0
8   Montu  12.0    Grey   1300.0         2600.0

In [96]:
#Filling Missing values
df["Age"].fillna(df["Age"].mean())

0    12.000
1    30.000
2    24.375
3    25.000
4    20.000
5     7.000
6    80.000
7     9.000
8    12.000
Name: Age, dtype: float64

In [97]:
df["Point"].fillna(df["Point"].median())

0     1300.0
1     2000.0
2     2300.0
3     3500.0
4     8800.0
5    45000.0
6     2300.0
7     2300.0
8     1300.0
Name: Point, dtype: float64

In [98]:
#Forward Fll (top->bottom)
df["Age"].ffill()

0    12.0
1    30.0
2    30.0
3    25.0
4    20.0
5     7.0
6    80.0
7     9.0
8    12.0
Name: Age, dtype: float64

In [99]:
#Backword Fill
df["Age"].bfill()

#First & Last value NaN (not working)

0    12.0
1    30.0
2    25.0
3    25.0
4    20.0
5     7.0
6    80.0
7     9.0
8    12.0
Name: Age, dtype: float64

In [100]:
df["Name"].replace("Chinta", "Darshonik")

0        Montu
1       Jhontu
2        Chotu
3         Boro
4        Dukhi
5        Sukhi
6    Darshonik
7        Utsuk
8        Montu
Name: Name, dtype: str

In [104]:
#df["Name"]=df["Name"].replace("Jhontu", "Chinta")
print(df)

     Name   Age    Team    Point  Wining Points
0   Montu  12.0    Grey   1300.0         2600.0
1  Chinta  30.0  Shadow   2000.0         4000.0
2   Chotu   NaN     Red      NaN            NaN
3    Boro  25.0     Red   3500.0         7000.0
4   Dukhi  20.0    Grey   8800.0        17600.0
5   Sukhi   7.0     NaN  45000.0        90000.0
6  Chinta  80.0   Black      NaN            NaN
7   Utsuk   9.0   Green   2300.0         4600.0
8   Montu  12.0    Grey   1300.0         2600.0

In [112]:
#Duplicate Values
dup=df[df.duplicated(keep="last")] #by default-> keep="first"

In [113]:
dup #Second Repeated records

    Name   Age  Team   Point  Wining Points
0  Montu  12.0  Grey  1300.0         2600.0

In [116]:
#Invalid Values
#Lambda ->Python

df["Wining Points"] = df["Wining Points"].apply(lambda x: x/10 if x>3000 else x)

In [119]:
df

     Name   Age    Team    Point  Wining Points
0   Montu  12.0    Grey   1300.0         2600.0
1  Chinta  30.0  Shadow   2000.0          400.0
2   Chotu   NaN     Red      NaN            NaN
3    Boro  25.0     Red   3500.0          700.0
4   Dukhi  20.0    Grey   8800.0         1760.0
5   Sukhi   7.0     NaN  45000.0          900.0
6  Chinta  80.0   Black      NaN            NaN
7   Utsuk   9.0   Green   2300.0          460.0
8   Montu  12.0    Grey   1300.0         2600.0

In [121]:
# apply and lambda
def multiplying_Age(x):
    return x**2
df["Age"] = df["Age"].apply(multiplying_Age)

In [122]:
df

     Name     Age    Team    Point  Wining Points
0   Montu   144.0    Grey   1300.0         2600.0
1  Chinta   900.0  Shadow   2000.0          400.0
2   Chotu     NaN     Red      NaN            NaN
3    Boro   625.0     Red   3500.0          700.0
4   Dukhi   400.0    Grey   8800.0         1760.0
5   Sukhi    49.0     NaN  45000.0          900.0
6  Chinta  6400.0   Black      NaN            NaN
7   Utsuk    81.0   Green   2300.0          460.0
8   Montu   144.0    Grey   1300.0         2600.0

In [123]:
df["Age"] = df["Age"].apply(lambda x: np.sqrt(x))

In [124]:
df

     Name   Age    Team    Point  Wining Points
0   Montu  12.0    Grey   1300.0         2600.0
1  Chinta  30.0  Shadow   2000.0          400.0
2   Chotu   NaN     Red      NaN            NaN
3    Boro  25.0     Red   3500.0          700.0
4   Dukhi  20.0    Grey   8800.0         1760.0
5   Sukhi   7.0     NaN  45000.0          900.0
6  Chinta  80.0   Black      NaN            NaN
7   Utsuk   9.0   Green   2300.0          460.0
8   Montu  12.0    Grey   1300.0         2600.0

In [132]:
#Joins & Merges

In [139]:
data2 = {
    "Name" : ["Montu", "Jhontu", "Chotu", "Boro", "Dukhi", "Sukhi", "Chinta", "Utsuk", "Montu"],
    "Location" : ["DHK", "RAJ", "CHT", "CHT", "DHK","KHULNA", "KHULNA", "CHT","RAJ"],
    "Distance" : [0, 600, 800, 800, 0, 950, 950,800,600]
}

In [140]:
df2 = pd.DataFrame(data2)
df2

     Name Location  Distance
0   Montu      DHK         0
1  Jhontu      RAJ       600
2   Chotu      CHT       800
3    Boro      CHT       800
4   Dukhi      DHK         0
5   Sukhi   KHULNA       950
6  Chinta   KHULNA       950
7   Utsuk      CHT       800
8   Montu      RAJ       600

In [142]:
pd.concat([df,df2])

     Name   Age    Team    Point  Wining Points Location  Distance
0   Montu  12.0    Grey   1300.0         2600.0      NaN       NaN
1  Chinta  30.0  Shadow   2000.0          400.0      NaN       NaN
2   Chotu   NaN     Red      NaN            NaN      NaN       NaN
3    Boro  25.0     Red   3500.0          700.0      NaN       NaN
4   Dukhi  20.0    Grey   8800.0         1760.0      NaN       NaN
5   Sukhi   7.0     NaN  45000.0          900.0      NaN       NaN
6  Chinta  80.0   Black      NaN            NaN      NaN       NaN
7   Utsuk   9.0   Green   2300.0          460.0      NaN       NaN
8   Montu  12.0    Grey   1300.0         2600.0      NaN       NaN
0   Montu   NaN     NaN      NaN            NaN      DHK       0.0
1  Jhontu   NaN     NaN      NaN            NaN      RAJ     600.0
2   Chotu   NaN     NaN      NaN            NaN      CHT     800.0
3    Boro   NaN     NaN      NaN            NaN      CHT     800.0
4   Dukhi   NaN     NaN      NaN            NaN      DHK       0.0
5   Sukhi   NaN     NaN      NaN            NaN   KHULNA     950.0
6  Chinta   NaN     NaN      NaN            NaN   KHULNA     950.0
7   Utsuk   NaN     NaN      NaN            NaN      CHT     800.0
8   Montu   NaN     NaN      NaN            NaN      RAJ     600.0

In [143]:
pd.merge(df,df2,on="Name")

      Name   Age    Team    Point  Wining Points Location  Distance
0    Montu  12.0    Grey   1300.0         2600.0      DHK         0
1    Montu  12.0    Grey   1300.0         2600.0      RAJ       600
2   Chinta  30.0  Shadow   2000.0          400.0   KHULNA       950
3    Chotu   NaN     Red      NaN            NaN      CHT       800
4     Boro  25.0     Red   3500.0          700.0      CHT       800
5    Dukhi  20.0    Grey   8800.0         1760.0      DHK         0
6    Sukhi   7.0     NaN  45000.0          900.0   KHULNA       950
7   Chinta  80.0   Black      NaN            NaN   KHULNA       950
8    Utsuk   9.0   Green   2300.0          460.0      CHT       800
9    Montu  12.0    Grey   1300.0         2600.0      DHK         0
10   Montu  12.0    Grey   1300.0         2600.0      RAJ       600

#### Importing Files